build/surefire-reports/src.test.resources.features.karate_soap_uno.html

<!DOCTYPE html>
<html lang="en">
  
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
    
<meta charset="utf-8">
    
<meta content="width=device-width, initial-scale=1, shrink-to-fit=no" name="viewport">
    
<link href="res/bootstrap.min.css" rel="stylesheet" type="text/css">
    
<link href="res/karate-report.css" rel="stylesheet" type="text/css">
    
<link href="favicon.ico" rel="shortcut icon">
    
<script src="res/jquery.min.js" type="text/javascript"></script>
    <script src="res/jquery.tablesorter.min.js" type="text/javascript"></script>
    <script src="res/bootstrap.min.js" type="text/javascript"></script>
    <script src="res/karate-report.js" type="text/javascript"></script>
    
<title>src.test.resources.features.karate_soap_uno</title>
  
</head>
  
<body>
    
<div id="root-container">
      
<div id="leftnav">
        
<div class="nav-logo">
          
<a href="karate-summary.html">
            <img alt="Karate" src="res/karate-logo.svg">
          </a>
          
<div class="nav-count">
            
<div class="bg-success" id="nav-pass">2</div>
            
<div class="bg-danger" id="nav-fail">0</div>
          
</div>
        
</div>
        
<div id="nav-type">Scenarios</div>         
        
<div id="nav-date">2020-12-07 03:36:13 PM</div>        
      
<div class="nav-container">
<div class="nav-item passed">
<a href="#[1.1:28]">[1.1:28] soap service </a>
</div>
<div class="nav-item passed">
<a href="#[1.2:29]">[1.2:29] soap service </a>
</div>
</div>
</div>
      
<div id="content">
      
<div class="page-heading alert alert-primary">
<a href="karate-summary.html">Summary</a><span class="feature-label">|</span><a href="karate-tags.html">Tags</a><span class="feature-label">|</span><span class="feature-label">Feature:</span><span class="feature-name">src/test/resources/features/karate_soap_uno.feature</span><span class="feature-description">Ejemplo uno calculadora - Servicio Soap  Automatizaci&oacute;n Karate DSL Q-Vision</span>
</div>
<div class="scenario">
<div class="scenario-heading" id="[1.1:28]">
<div class="heading-container">
<div class="scenario-tags"></div>
<span class="scenario-keyword">Scenario Outline: [1.1:28]</span><span class="scenario-name">soap service </span>
</div>
<div class="scenario-time passed">ms: 1305</div>
</div>
<div class="step-row">
<div class="step-container" id="[1.1:28]bg">
<div class="step-ref bg-step">&gt;&gt;</div>
<div class="step-cell passed">Background:</div>
</div>
<div class="time-cell passed"></div>
</div>
<div class="step-row" data-parent="[1.1:28]bg">
<div class="step-container" id="1">
<div class="step-ref bg-step">1</div>
<div class="step-cell passed">* def urlX = 'http://www.dneonline.com/calculator.asmx'</div>
</div>
<div class="time-cell passed">8</div>
</div>
<div class="preformatted" data-parent="1">15:36:11.433 skipping bootstrap configuration: could not find or read file: classpath:karate-config.js</div>
<div class="step-row" data-parent="[1.1:28]bg">
<div class="step-container" id="2">
<div class="step-ref bg-step">2</div>
<div class="step-cell passed">* header Content-Type = 'text/xml'</div>
</div>
<div class="time-cell passed">4</div>
</div>
<div class="step-row">
<div class="step-container" id="3">
<div class="step-ref passed">3</div>
<div class="step-cell passed">Given url urlX + '?op=Add'</div>
</div>
<div class="time-cell passed">6</div>
</div>
<div class="step-row">
<div class="step-container" id="4">
<div class="step-ref passed">4</div>
<div class="step-cell passed">And request</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="preformatted" data-parent="4">&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;tem:Add&gt;
         &lt;tem:intA&gt;7&lt;/tem:intA&gt;
         &lt;tem:intB&gt;3&lt;/tem:intB&gt;
      &lt;/tem:Add&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="5">
<div class="step-ref passed">5</div>
<div class="step-cell passed">When method post</div>
</div>
<div class="time-cell passed">1249</div>
</div>
<div class="preformatted" data-parent="5">15:36:12.207 request:
1 &gt; POST http://www.dneonline.com/calculator.asmx?op=Add
1 &gt; Accept-Encoding: gzip,deflate
1 &gt; Connection: Keep-Alive
1 &gt; Content-Length: 291
1 &gt; Content-Type: text/xml; charset=UTF-8
1 &gt; Host: www.dneonline.com
1 &gt; User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_231)
&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"&gt;&#13;
   &lt;soapenv:Header/&gt;&#13;
   &lt;soapenv:Body&gt;&#13;
      &lt;tem:Add&gt;&#13;
         &lt;tem:intA&gt;7&lt;/tem:intA&gt;&#13;
         &lt;tem:intB&gt;3&lt;/tem:intB&gt;&#13;
      &lt;/tem:Add&gt;&#13;
   &lt;/soapenv:Body&gt;&#13;
&lt;/soapenv:Envelope&gt;

15:36:12.726 response time in milliseconds: 515,61
1 &lt; 200
1 &lt; Cache-Control: private, max-age=0
1 &lt; Content-Type: text/xml; charset=utf-8
1 &lt; Date: Mon, 07 Dec 2020 20:36:12 GMT
1 &lt; Server: Microsoft-IIS/7.5
1 &lt; Vary: Accept-Encoding
1 &lt; X-AspNet-Version: 2.0.50727
1 &lt; X-Powered-By: ASP.NET
&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;&lt;soap:Body&gt;&lt;AddResponse xmlns="http://tempuri.org/"&gt;&lt;AddResult&gt;10&lt;/AddResult&gt;&lt;/AddResponse&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="6">
<div class="step-ref passed">6</div>
<div class="step-cell passed">Then status 200</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="step-row">
<div class="step-container" id="7">
<div class="step-ref passed">7</div>
<div class="step-cell passed">And match /Envelope/Body/AddResponse/AddResult == 10</div>
</div>
<div class="time-cell passed">30</div>
</div>
<div class="step-row">
<div class="step-container" id="8">
<div class="step-ref passed">8</div>
<div class="step-cell passed">And print 'response: ', response</div>
</div>
<div class="time-cell passed">6</div>
</div>
<div class="preformatted" data-parent="8">15:36:12.766 [print] response:  &lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
  &lt;soap:Body&gt;&#13;
    &lt;AddResponse xmlns="http://tempuri.org/"&gt;&#13;
      &lt;AddResult&gt;10&lt;/AddResult&gt;&#13;
    &lt;/AddResponse&gt;&#13;
  &lt;/soap:Body&gt;&#13;
&lt;/soap:Envelope&gt;</div>
</div>
<div class="scenario">
<div class="scenario-heading" id="[1.2:29]">
<div class="heading-container">
<div class="scenario-tags"></div>
<span class="scenario-keyword">Scenario Outline: [1.2:29]</span><span class="scenario-name">soap service </span>
</div>
<div class="scenario-time passed">ms: 366</div>
</div>
<div class="step-row">
<div class="step-container" id="[1.2:29]bg">
<div class="step-ref bg-step">&gt;&gt;</div>
<div class="step-cell passed">Background:</div>
</div>
<div class="time-cell passed"></div>
</div>
<div class="step-row" data-parent="[1.2:29]bg">
<div class="step-container" id="9">
<div class="step-ref bg-step">9</div>
<div class="step-cell passed">* def urlX = 'http://www.dneonline.com/calculator.asmx'</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="preformatted" data-parent="9">15:36:12.781 skipping bootstrap configuration: could not find or read file: classpath:karate-config.js</div>
<div class="step-row" data-parent="[1.2:29]bg">
<div class="step-container" id="10">
<div class="step-ref bg-step">10</div>
<div class="step-cell passed">* header Content-Type = 'text/xml'</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="step-row">
<div class="step-container" id="11">
<div class="step-ref passed">11</div>
<div class="step-cell passed">Given url urlX + '?op=Multiply'</div>
</div>
<div class="time-cell passed">4</div>
</div>
<div class="step-row">
<div class="step-container" id="12">
<div class="step-ref passed">12</div>
<div class="step-cell passed">And request</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="preformatted" data-parent="12">&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;tem:Multiply&gt;
         &lt;tem:intA&gt;5&lt;/tem:intA&gt;
         &lt;tem:intB&gt;3&lt;/tem:intB&gt;
      &lt;/tem:Multiply&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="13">
<div class="step-ref passed">13</div>
<div class="step-cell passed">When method post</div>
</div>
<div class="time-cell passed">328</div>
</div>
<div class="preformatted" data-parent="13">15:36:12.796 request:
1 &gt; POST http://www.dneonline.com/calculator.asmx?op=Multiply
1 &gt; Accept-Encoding: gzip,deflate
1 &gt; Connection: Keep-Alive
1 &gt; Content-Length: 301
1 &gt; Content-Type: text/xml; charset=UTF-8
1 &gt; Host: www.dneonline.com
1 &gt; User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_231)
&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"&gt;&#13;
   &lt;soapenv:Header/&gt;&#13;
   &lt;soapenv:Body&gt;&#13;
      &lt;tem:Multiply&gt;&#13;
         &lt;tem:intA&gt;5&lt;/tem:intA&gt;&#13;
         &lt;tem:intB&gt;3&lt;/tem:intB&gt;&#13;
      &lt;/tem:Multiply&gt;&#13;
   &lt;/soapenv:Body&gt;&#13;
&lt;/soapenv:Envelope&gt;

15:36:13.115 response time in milliseconds: 317,33
1 &lt; 200
1 &lt; Cache-Control: private, max-age=0
1 &lt; Content-Type: text/xml; charset=utf-8
1 &lt; Date: Mon, 07 Dec 2020 20:36:13 GMT
1 &lt; Server: Microsoft-IIS/7.5
1 &lt; Vary: Accept-Encoding
1 &lt; X-AspNet-Version: 2.0.50727
1 &lt; X-Powered-By: ASP.NET
&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;&lt;soap:Body&gt;&lt;MultiplyResponse xmlns="http://tempuri.org/"&gt;&lt;MultiplyResult&gt;15&lt;/MultiplyResult&gt;&lt;/MultiplyResponse&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="14">
<div class="step-ref passed">14</div>
<div class="step-cell passed">Then status 200</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="step-row">
<div class="step-container" id="15">
<div class="step-ref passed">15</div>
<div class="step-cell passed">And match /Envelope/Body/MultiplyResponse/MultiplyResult == 15</div>
</div>
<div class="time-cell passed">23</div>
</div>
<div class="step-row">
<div class="step-container" id="16">
<div class="step-ref passed">16</div>
<div class="step-cell passed">And print 'response: ', response</div>
</div>
<div class="time-cell passed">8</div>
</div>
<div class="preformatted" data-parent="16">15:36:13.149 [print] response:  &lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
  &lt;soap:Body&gt;&#13;
    &lt;MultiplyResponse xmlns="http://tempuri.org/"&gt;&#13;
      &lt;MultiplyResult&gt;15&lt;/MultiplyResult&gt;&#13;
    &lt;/MultiplyResponse&gt;&#13;
  &lt;/soap:Body&gt;&#13;
&lt;/soap:Envelope&gt;</div>
</div>
</div>
    
</div>   
  
</body>

</html>
